["What is red and smells like blue paint?\\n-Red paint!","What did the shy pebble wish for?\\n-That she was a little boulder.","What did the big flower say to the littler flower?\\n-Hi, bud!","What does a pirate pay for his corn?\\n-A buccaneer!","What did the fish say when it hit the wall?\\n-Dam.","How come a man driving a train got struck by lightning?\\n-He was a good conductor.","Why did the invisible man turn down the job offer?\\n-He couldn't see himself doing it","Have you heard the rumor going around about butter?\\n-Never mind, I shouldn't spread it.","What do prisoners use to call each other?\\n-Cell phones.","What time is it?\\n-I don't know... it keeps changing.","What do you call sad coffee?\\n-Despresso.","Don't look at the eclipse through a colander.\\n-You'll strain your eyes.","Hey, dad, did you get a haircut?\\n-No, I got them all cut.","What did the mountain climber name his son?\\n-Cliff.","Where do rabbits go after they get married?\\n-On a bunny-moon.","What did the pirate say on his 80th birthday?\\n-Aye Matey!","What did the late tomato say to the early tomato?\\n-I’ll ketch up","Do I enjoy making courthouse puns?\\n-Guilty","What's the best time to go to the dentist?\\n-Tooth hurty.","What kind of music do planets listen to?\\n-Nep-tunes.","What did one plate say to the other plate?\\n-Dinner is on me!","I got hit in the head by a soda can, but it didn't hurt that much...\\n-It was a soft drink.","What did the grape do when he got stepped on?\\n-He let out a little wine.","What did the Buffalo say to his little boy when he dropped him off at school?\\n-Bison.","What do you call corn that joins the army?\\n-Kernel.","Did you know that protons have mass?\\n-I didn't even know they were catholic.","Knock knock. \\n Who's there? \\n Cows go. \\n Cows go who?\\n-No, cows go moo.","What is a tornado's favorite game to play?\\n-Twister!","Did you hear that the police have a warrant out on a midget psychic ripping people off?\\n-It reads \\"Small medium at large.\\"","What do you call a pile of cats?\\n- A Meowtain.","What's orange and sounds like a parrot?\\n-A Carrot.","What did the Zen Buddist say to the hotdog vendor?\\n-Make me one with everything.","What do you call a cow on a trampoline?\\n-A milk shake!","To understand what recursion is...\\n-You must first understand what recursion is","What do birds give out on Halloween?\\n-Tweets.","Why did the mushroom get invited to the party?\\n-Because he was a fungi.","Why did the scarecrow win an award?\\n-Because he was outstanding in his field.","What do you give a sick lemon?\\n-Lemonaid.","Can February march?\\n-No, but April may.","Did you hear the story about the cheese that saved the world?\\n-It was legend dairy.","What type of music do balloons hate?\\n-Pop music!","How does a French skeleton say hello?\\n-Bone-jour.","The punchline often arrives before the set-up.\\n-Do you know the problem with UDP jokes?","Why do choirs keep buckets handy?\\n-So they can carry their tune","What do you call a troublesome Canadian high schooler?\\n-A poutine.","A ham sandwhich walks into a bar and orders a beer. The bartender says...\\n-I'm sorry, we don't serve food here","What do you call a dictionary on drugs?\\n-High definition."]